CONFIG ={
    "ncols": 770,
    "nrows": 635,
    "xllcorner": 162085.309,
    "yllcorner": 2600864.874,
    "cellsize": 40.000,
    "NODATA_value": -999.9990,
    "input_dir": "flood",
    "output_dir": "static/output",
    "res_L1" : 7,  # 預設 L1 解析度為 7
    "res_L2" : 8,  # 預設 L2 解析度
    # [新增] 模擬的雲林鄉鎮中心座標 (WGS84)
    "YUNLIN_TOWNS": [
        #{"name": "斗六市", "coords": (23.709, 120.543)},
        #{"name": "斗南鎮", "coords": (23.676, 120.479)},
        #{"name": "虎尾鎮", "coords": (23.708, 120.431)},
        #"name": "西螺鎮", "coords": (23.795, 120.461)},
        #{"name": "土庫鎮", "coords": (23.676, 120.392)},
        #{"name": "北港鎮", "coords": (23.573, 120.301)},
        #{"name": "古坑鄉", "coords": (23.645, 120.562)},
        #{"name": "大埤鄉", "coords": (23.640, 120.431)},
        #{"name": "莿桐鄉", "coords": (23.760, 120.505)},
        #{"name": "林內鄉", "coords": (23.760, 120.612)},
        #{"name": "二崙鄉", "coords": (23.770, 120.413)},
        #{"name": "崙背鄉", "coords": (23.759, 120.354)},
        #{"name": "麥寮鄉", "coords": (23.744, 120.252)},
        {"name": "東勢鄉", "coords": (23.674, 120.253)},
        {"name": "褒忠鄉", "coords": (23.702, 120.315)},
        {"name": "臺西鄉", "coords": (23.703, 120.198)},
        {"name": "元長鄉", "coords": (23.646, 120.313)},
        {"name": "四湖鄉", "coords": (23.636, 120.222)},
        {"name": "口湖鄉", "coords": (23.579, 120.185)},
        {"name": "水林鄉", "coords": (23.575, 120.245)}
    ]
}   